
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода = НачалоНедели(ТекущаяДатаСеанса());
	КонецПериода = КонецНедели(ТекущаяДатаСеанса());
	
	Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоПериода,КонецПериода);
	
	ОбновитьПланировщик();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПланировщик();

	НачалоПериода = НачалоНедели(ТекущаяДатаСеанса());
	КонецПериода = КонецНедели(ТекущаяДатаСеанса());
	
	Планировщик.Элементы.Очистить();
	
	Тренировки = Документы.Тренировка.Выбрать(НачалоПериода,КонецПериода);
	
	Пока Тренировки.Следующий() Цикл
		
		НачалоТренировки = Тренировки.Дата;
		КонецТренировки = НачалоТренировки + Тренировки.Длительность * 60;
		
		ЭлементПланировщика = Планировщик.Элементы.Добавить(НачалоТренировки, КонецТренировки);
		ЭлементПланировщика.Значение = Тренировки.Ссылка;
		ЭлементПланировщика.Текст = Тренировки.Мероприятие;
		
	КонецЦикла

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьПланировщик();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Дата", Начало);
	ЗначенияЗаполнения.Вставить("Длительность", (Конец - Начало) / 60);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.Тренировка.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Мероприятие" ТОГДА
		ОбновитьПланировщик();
	КонецЕсли
	
	
КонецПроцедуры
