#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_Мероприятие",, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
		Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   Тренировка.Тренер
        |ИЗ
        |   Документ.Тренировка КАК Тренировка
        |ГДЕ
    	|   ((Тренировка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания) ИЛИ
		|	(ДОБАВИТЬКДАТЕ(Тренировка.Дата, Минута, Тренировка.Длительность) МЕЖДУ &ДатаНачала И &ДатаОкончания)) 
		|	И Тренировка.Номер <> &Номер
		|   И Тренировка.Тренер = &Тренер";

    Запрос.УстановитьПараметр("Тренер", ТекущийОбъект.Тренер);
    Запрос.УстановитьПараметр("ДатаНачала", ТекущийОбъект.Дата);
	Запрос.УстановитьПараметр("ДатаОкончания", ТекущийОбъект.Дата + 60 * ТекущийОбъект.Длительность);
	Запрос.УстановитьПараметр("Номер", ТекущийОбъект.Номер);
	
	Результат = Запрос.Выполнить();
    
    Если НЕ Результат.Пустой() Тогда
       Сообщить("Документ с такими реквизитами существует. Документ не может быть создан.");
       Отказ = Истина;
   КонецЕсли;
	
КонецПроцедуры

#КонецОбласти